
class NeyronСnn
{
public:
	// Конструкторы ----------------------------------------------------------
	NeyronСnn();
	NeyronСnn(const int& i, const int& j);
	NeyronСnn(const int** arr, const int& i, const int& j);
	NeyronСnn(const NeyronСnn& copy);

	// Методы класса ---------------------------------------------------------
	void Padding(); // Добавление "полей" к матрице
	// Pooling(); // Операция "пулинга"
	void Svertka(); // Операция свертки над матрицей значений


	// Деструктор ------------------------------------------------------------
	~NeyronСnn();
private:
	// Поля класса -----------------------------------------------------------
	int** arr; // Матрица значений
	int i, j; // Размер матрицы

};
